emacs/.emacs.d/config.org
* Generate
:PROPERTIES:
:ID:       1f28903d-6f9c-40c4-93ee-99764d547c22
:END:
** Test Configs
:PROPERTIES:
:ID:       7190b4e5-ba33-41bf-b7de-ff7bca98b542
:END:
This code block is for testing.

It controls the output location of the tangled code blocks by adding advice to filter the return value of ~org-babel-tangle-collect-blocks~.

If called with ~in-a-tmp-dir~ set to ~t~, it'll create a new temporary directory and tangle the code blocks there and then launch emacs. If called with ~in-a-tmp-dir~ set to ~nil~, it'll reuse a more permanent dev area of ~${HOME}/emacs.d-dev~, such that we don't have to install fresh copies of all packages every time.

This is meant to be called via the ~call~ sites in the two subtrees below (although calling it directly from this block is equivalent to calling the first one).

#+name: emacs-config-generate-and-run
#+begin_src emacs-lisp :var in-a-tmp-dir='nil :results value verbatim :eval no
  ;;; -*- lexical-binding: t; -*-

  (let* ((d (if in-a-tmp-dir
                (make-temp-file "emacs.d-" t)
              (expand-file-name "~/emacs.d-dev")))
         (buffer-name "*emacs-config-testing*")
         (display-buffer-alist
          `((,(regexp-quote buffer-name)
             . (display-buffer-no-window . ((allow-no-window . t)))))))
    (make-directory d t)
    (make-directory (file-name-concat d "straight" "versions") t)
    ;; Delete the stuff we're tangling and the lisp we're copying in below
    (ignore-errors
      (delete-file (file-name-concat d "early-init.el"))
      (delete-file (file-name-concat d "init.el"))
      (delete-directory (file-name-concat d "init-lisp") t)
      (delete-directory (file-name-concat d "lisp") t)
      (delete-directory (file-name-concat d "straight" "versions") t))
    ;; Copy in lisp that we've added to our repo manually
    (copy-directory
     (file-name-concat (file-name-directory user-init-file) "lisp")
     (file-name-concat d "lisp")
     nil t t)
    ;; Straight versions
    (copy-directory
     (file-name-concat
      (file-name-directory user-init-file)
      "straight"
      "versions")
     (file-name-concat
      d
      "straight"
      "versions"))
    (defun cp/org-babel-tangle-collect-blocks-advice (result)
      (mapcar
       (lambda (entry)
         (let* ((path (car entry))
                (f-without-default-dir
                 (string-replace
                  (file-name-as-directory default-directory) "" path)))
           (cons
            (file-name-concat d f-without-default-dir)
            (cdr entry))))
       result))
    (unwind-protect
        (progn
          (advice-add 'org-babel-tangle-collect-blocks
                      :filter-return
                      #'cp/org-babel-tangle-collect-blocks-advice)
          (org-babel-tangle))
      (advice-remove 'org-babel-tangle-collect-blocks
                     #'cp/org-babel-tangle-collect-blocks-advice)
      (fmakunbound #'cp/org-babel-tangle-collect-blocks-advice))
    (let* ((base (format "alacritty -e emacs -nw --init-directory '%s'" d))
           (cmd
            (if in-a-tmp-dir
                base
              (format "%s --eval '(straight-thaw-versions)'" base))))
      (async-shell-command cmd buffer-name)))
#+end_src

*** In a reusable directory

#+call: emacs-config-generate-and-run[:eval yes](in-a-tmp-dir='nil)

#+RESULTS:
: nil

*** In a temporary directory

#+call: emacs-config-generate-and-run[:eval yes](in-a-tmp-dir='t)

#+RESULTS:
: nil

** Real Configs
This code block generates my actual config. After running this, I'd typically diff the results to make sure they look like I want and then commit the result.

You can also just run:

: M-x org-babel-tangle

But, having the list of files generated is kind of nice.

#+name: emacs-config-generate
#+begin_src emacs-lisp :results value list
  ;;; -*- lexical-binding: t; -*-

  (thread-last
    (org-babel-tangle)
    (mapcar
     (lambda (path)
       (string-replace
        (file-name-as-directory (expand-file-name "~")) "" path)))
    (reverse))
#+end_src

#+RESULTS: emacs-config-generate
- .dotfiles/emacs/.emacs.d/early-init.el
- .dotfiles/emacs/.emacs.d/init.el
- .dotfiles/emacs/.emacs.d/init-lisp/init-emacs.el
- .dotfiles/emacs/.emacs.d/init-lisp/init-straight.el
- .dotfiles/emacs/.emacs.d/init-lisp/init-general.el
- .dotfiles/emacs/.emacs.d/init-lisp/init-utils.el
- .dotfiles/emacs/.emacs.d/init-lisp/init-hippie-exp.el
- .dotfiles/emacs/.emacs.d/init-lisp/init-uniquify.el
- .dotfiles/emacs/.emacs.d/init-lisp/init-windsize.el
- .dotfiles/emacs/.emacs.d/init-lisp/init-ibuffer-vc.el
- .dotfiles/emacs/.emacs.d/init-lisp/init-which-key.el
- .dotfiles/emacs/.emacs.d/init-lisp/init-dired.el
- .dotfiles/emacs/.emacs.d/init-lisp/init-escreen.el
- .dotfiles/emacs/.emacs.d/init-lisp/init-xcscope.el
- .dotfiles/emacs/.emacs.d/init-lisp/init-smartparens.el
- .dotfiles/emacs/.emacs.d/init-lisp/init-evil.el
- .dotfiles/emacs/.emacs.d/init-lisp/init-embark.el
- .dotfiles/emacs/.emacs.d/init-lisp/init-lisp.el
- .dotfiles/emacs/.emacs.d/init-lisp/init-shell.el
- .dotfiles/emacs/.emacs.d/init-lisp/init-rust.el
- .dotfiles/emacs/.emacs.d/init-lisp/init-ocaml.el
- .dotfiles/emacs/.emacs.d/init-lisp/init-org.el
- .dotfiles/emacs/.emacs.d/init-lisp/init-projectile.el
- .dotfiles/emacs/.emacs.d/init-lisp/init-local-overrides.el

* Blocks
:PROPERTIES:
:header-args:emacs-lisp: :mkdirp yes
:END:
** Notes
These code blocks are meant to be tangled into my emacs initialization file(s).

You should invoke one of the code blocks in the [[id:1f28903d-6f9c-40c4-93ee-99764d547c22][Generate]] subtree to either generate test configs and launch an instance of emacs for testing those configs, or simply generate the actual configs (which can then be committed).

The code block above uses advice to modify the output directory for the tangled files, so it's possible it'll break in the future if the structure of the return value of ~org-babel-tangle-collect-blocks~ changes.

You can omit subtrees from the tangle by commenting them via ~org-toggle-comment~, or you can omit individual code blocks by overriding their ~tangle~ header with:

: :tangle no

If you want to tangle to a different file, you just have to add another subtree ~:tangle~ property or header arg like:

: :tangle "init-lisp/init-foo.el"

Also we're using ~load~ instead of ~require~ for all our init files to make sure that straight's forms are reevalulated if our init file is loaded again. See [[https://github.com/radian-software/straight.el#how-does-straightel-know-what-packages-are-installed][How does straight.el know what packages are installed?]] as well as [[https://github.com/radian-software/straight.el/issues/437]["Caches are still outdated; something is seriously wrong" #437]] for why.

** Early Init
Disable the built in emacs package manager, we're going to use another one.

#+begin_src emacs-lisp :tangle early-init.el
  (when (> emacs-major-version 27)
    (setq package-enable-at-startup nil))
#+end_src

** Load Path

#+begin_src emacs-lisp :tangle init.el
  ;; -*- lexical-binding: t -*-
  (add-to-list 'load-path (expand-file-name "init-lisp" user-emacs-directory))
#+end_src

** Emacs
This uses the ~emacs~ package, which is always available.

#+begin_src emacs-lisp :tangle init.el :padline no
  (load "init-emacs")
#+end_src

Note that ~confirm-kill-emacs~ being set to ~yes-or-no-p~ is not about the long or the short version of prompting (we're getting the short version by virtue of ~use-short-answers~), but it's about being prompted before quitting emacs.

#+begin_src emacs-lisp :tangle init-lisp/init-emacs.el
  (use-package emacs
    :demand t
    :preface
    (defun cp/reduce-gc-cons-threshold ()
      (setq gc-cons-threshold (* 20 1000 1000)))
    :custom
    (ad-redefinition-action #'accept)
    (c-default-style '((java-mode . "java")
                       (awk-mode . "awk")
                       (other . "linux")))
    (column-number-mode t)
    (confirm-kill-emacs #'yes-or-no-p)
    (create-lockfiles nil)
    (custom-file (expand-file-name "custom.el" user-emacs-directory))
    (enable-recursive-minibuffers t)
    (gc-cons-threshold (* 100 1000 1000))
    (grep-find-use-xargs 'gnu-sort)
    (hs-isearch-open t)
    (indent-tabs-mode nil)
    (inhibit-startup-message t)
    (load-prefer-newer t)
    ;; CR-someday cperl: consider nolittering
    (make-backup-files nil)
    (native-comp-async-report-warnings-errors nil)
    (show-paren-delay 0)
    (split-window-preferred-function #'cp/split-window-function)
    (use-short-answers t)
    (window-combination-resize t)
    :config
    (put 'narrow-to-region 'disabled nil)
    (menu-bar-mode -1)
    (tool-bar-mode -1)
    (scroll-bar-mode -1)
    (global-auto-revert-mode)
    (show-paren-mode)
    (winner-mode)
    :hook
    ((emacs-startup . cp/reduce-gc-cons-threshold)
     (emacs-startup . cp/startup-time)
     (prog-mode . turn-on-auto-fill)
     (c-mode . cp/enable-hideshow-and-hide-all)))

  (defun cp/enable-hideshow-and-hide-all ()
    (hs-minor-mode)
    (hs-hide-all))

  (defun cp/startup-time ()
    (message "Emacs ready in %s with %d garbage collections."
             (format "%.2f seconds"
                     (float-time
                      (time-subtract after-init-time before-init-time)))
             gcs-done))

  (defun cp/split-window-function (&rest r)
    "When there is one window, split it horizontally unless the frame is
  smaller than 120.

    If there are multiple windows, don't split anything."
    (let ((width (frame-text-width))
          (nwindows (length (window-list))))
      (if (= nwindows 1)
          (if (< width 120) (split-window-below) (split-window-right))
        nil)))

  (defun cp/revert-buffer-all ()
    "Revert all buffers.  This reverts buffers that are visiting a file, kills
    buffers whose visited file has disappeared and refreshes dired
    buffers."
    (interactive)
    (if (y-or-n-p "Revert ALL buffers? ")
        (save-excursion
          (dolist (b (buffer-list))
            (set-buffer b)
            (cond
             (buffer-file-name
              (if (file-exists-p buffer-file-name)
                  (revert-buffer t t t)
                (kill-buffer b)))
             ((eq major-mode 'dired-mode) (revert-buffer t t t)))))))
#+end_src

** Straight

#+begin_src emacs-lisp :tangle init.el :padline no
  (load "init-straight")
#+end_src

#+begin_src emacs-lisp :tangle init-lisp/init-straight.el
    (setq straight-cache-autoloads t
          straight-check-for-modifications nil)
    (defvar bootstrap-version)
    (let ((bootstrap-file
           (expand-file-name
            "straight/repos/straight.el/bootstrap.el"
            (or (bound-and-true-p straight-base-dir)
                user-emacs-directory)))
          (bootstrap-version 7))
      (unless (file-exists-p bootstrap-file)
        (with-current-buffer
            (url-retrieve-synchronously
             "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
             'silent 'inhibit-cookies)
          (goto-char (point-max))
          (eval-print-last-sexp)))
        (load bootstrap-file nil 'nomessage))

  (dolist
      (package
       '(annalist
         company-mode
         compat
         counsel-projectile
         diminish
         elisp-slime-nav
         embark
         flycheck
         go-mode
         haskell-mode
         highlight-parentheses
         ibuffer-projectile
         ivy-rich
         json-mode
         lsp-mode
         lua-mode
         kdl-mode
         magit
         markdown-mode
         nasm-mode
         nerd-icons
         org-ql
         origami
         projectile
         smex
         doom-modeline
         swiper
         systemd-mode
         systemtap-mode
         tuareg-mode
         unfill
         vagrant-tramp
         wgrep
         windsize
         zenburn-theme))
    (straight-use-package package))
#+end_src

