emacs/.emacs.d/init.el
;; -*- lexical-binding: t -*-
(add-to-list 'load-path (expand-file-name "init-lisp" user-emacs-directory))
(load "init-emacs")
(load "init-straight")
