emacs/.emacs.d/config.org
** General

We're ammending the recipe for general below to use ~:nonrecursive~ because otherwise straight will clone it's ~makem~ git submodule. That submodule isn't needed to use the package (it's needed to develop the package) and we can wind up with the submodule checked out to the wrong revision, leading straight to tell us the worktree is dirty when it's actually fine.

It's possible that ~straight-thaw-versions~ should also call something like ~git submodule update~ when checking out a different revision, but I haven't dug into it much.

It's a similar issue to [[https://github.com/karthink/gptel/issues/716][test submodule marks repo as dirty in straight.el #716]] in gptel.

#+begin_src emacs-lisp :tangle init.el :padline no
  (load "init-general")
#+end_src

#+begin_src emacs-lisp :tangle init-lisp/init-general.el
  (use-package general
    :demand t
    :straight (:nonrecursive t)
    :config
    (defconst cp/normal-prefix "SPC")
    (defconst cp/non-normal-prefix "M-SPC"))
#+end_src

** Utils
These are just libraries that I find useful when writing elisp.

#+begin_src emacs-lisp :tangle init.el :padline no
  (load "init-utils")
#+end_src

#+begin_src emacs-lisp :tangle init-lisp/init-utils.el :padline no
  (use-package s
    :defer t
    :straight t)
  (use-package f
    :defer t
    :straight t)
  (use-package dash
    :defer t
    :straight t)
  (use-package hydra
    :defer t
    :straight t)
#+end_src

** Hippie Expand

#+begin_src emacs-lisp :tangle init.el :padline no
  (load "init-hippie-exp")
#+end_src

#+begin_src emacs-lisp :tangle init-lisp/init-hippie-exp.el
  (use-package hippie-exp
    :defer t
    :custom
    (hippie-expand-try-functions-list
     '(try-expand-dabbrev
       try-expand-dabbrev-all-buffers
       try-expand-dabbrev-from-kill
       try-complete-file-name-partially
       try-complete-file-name
       try-expand-all-abbrevs
       try-expand-list
       try-expand-line
       try-complete-lisp-symbol-partially
       try-complete-lisp-symbol))
    :bind
    ([remap dabbrev-expand] . #'hippie-expand))
#+end_src

** Uniquify

#+begin_src emacs-lisp :tangle init.el :padline no
  (load "init-uniquify")
#+end_src

#+begin_src emacs-lisp :tangle init-lisp/init-uniquify.el
  (use-package uniquify
    :defer t
    :custom
    (uniquify-buffer-name-style 'post-forward)
    (uniquify-separator " @")
    (uniquify-strip-common-suffix nil)
    (uniquify-after-kill-buffer-p t))
#+end_src

** Windsize

#+begin_src emacs-lisp :tangle init.el :padline no
  (load "init-windsize")
#+end_src

#+begin_src emacs-lisp :tangle init-lisp/init-windsize.el
  (use-package windsize
    :defer t
    :commands (cp/hydra-windsize/body)
    :config
    (defhydra cp/hydra-windsize (nil nil)
      "resize"
      ("h" windsize-left  "left")
      ("j" windsize-down  "down")
      ("k" windsize-up    "up")
      ("l" windsize-right "right")))
#+end_src

** Ibuffer

#+begin_src emacs-lisp :tangle init.el :padline no
  (load "init-ibuffer-vc")
#+end_src

#+begin_src emacs-lisp :tangle init-lisp/init-ibuffer-vc.el
  (use-package ibuffer-vc
    :defer t
    :straight t
    :after ibuffer
    :preface
    (defun cp/ibuffer-hook-setup ()
      (ibuffer-vc-set-filter-groups-by-vc-root)
      (unless (eq ibuffer-sorting-mode 'alphbaetic)
        (ibuffer-do-sort-by-alphabetic)))
    :hook
    ((ibuffer . cp/ibuffer-hook-setup))
    :general
    (:keymaps '(ibuffer-mode-map)
     :states  '(emacs)
     "l" #'ibuffer-visit-buffer
     "j" #'evil-next-line
     "k" #'evil-previous-line
     "r" #'ibuffer-update
     )
    )
#+end_src

** Which-key

#+begin_src emacs-lisp :tangle init.el :padline no
  (load "init-which-key")
#+end_src

#+begin_src emacs-lisp :tangle init-lisp/init-which-key.el
  (use-package which-key
    :demand t
    :custom
    (which-key-idle-delay 1.0)
    :config
    (which-key-mode))
#+end_src

** Dired

#+begin_src emacs-lisp :tangle init.el :padline no
  (load "init-dired")
#+end_src

#+begin_src emacs-lisp :tangle init-lisp/init-dired.el
  (use-package dired
    :defer t
    :general
    (:keymaps '(dired-mode-map)
     :states  '(normal motion)
     "h" #'dired-up-directory
     "l" #'dired-find-file
     "."   #'cp/dired-toggle-hiding-dotfiles
     "TAB" #'cp/dired-tab-dwim
     "M-&" #'cp/dired-smart-async-shell-command)
    :hook
    ((dired-mode . dired-omit-mode))
    :custom
    (dired-listing-switches "-aBhl --group-directories-first")
    (dired-dwim-target t)
    :config
    (put 'dired-find-alternate-file 'disabled nil))

  (use-package dired-x
    :defer t
    :after dired)

  (defun cp/dired-tab-dwim ()
    (interactive)
    (if (dired-get-subdir)
        (dired-hide-subdir 1)
      (ignore-errors
        (dired-find-file-other-window))))

  (defun cp/dired-toggle-hiding-dotfiles ()
    (interactive)
      (let ((regex "^\\..*$")
            (elements (s-split "\\\\|" dired-omit-files)))
        (if (-contains? elements regex)
            (setq dired-omit-files (s-join "\\|" (-remove-item regex elements)))
          (setq dired-omit-files (s-join "\\|" (-insert-at 0 regex elements))))
        (revert-buffer)
        (message "dired-omit-files is now: %S" dired-omit-files)))

  (defun cp/dired-smart-async-shell-command (command &optional output-buffer error-buffer)
    "Like function `async-shell-command', but in the current Virtual
  Dired directory.  Copied from `dired-smart-shell-command' from
  dired-x"
    (interactive
     (list
      (read-shell-command "Async shell command: " nil nil
  			(cond
  			 (buffer-file-name (file-relative-name buffer-file-name))
  			 ((eq major-mode 'dired-mode) (dired-get-filename t t))))
      current-prefix-arg
      shell-command-default-error-buffer))
    (let ((default-directory (or (and (eq major-mode 'dired-mode)
                                      (dired-current-directory))
                                 default-directory)))
      (async-shell-command command output-buffer error-buffer)))
#+end_src

