emacs/.emacs.d/init.el
(load "init-general")
(load "init-utils")
(load "init-hippie-exp")
(load "init-uniquify")
(load "init-windsize")
(load "init-ibuffer-vc")
(load "init-which-key")
(load "init-dired")
