emacs/.emacs.d/init.el
(load "init-escreen")
