emacs/.emacs.d/config.org
*** OCaml

I haven't written any OCaml in a while, so it's possible I should just do away with these forward sexp funs and there is a better method based on tree-sitter or what have you.

Either way, I sort of yolo converted the regexes to Rx notation, so I probably broke something.

#+begin_src emacs-lisp :tangle init.el :padline no
  (load "init-ocaml")
#+end_src

#+begin_src emacs-lisp :tangle init-lisp/init-ocaml.el
  (use-package tuareg
    :defer t
    :config
    (add-to-list
       'hs-special-modes-alist
       `(tuareg-mode
         ,cp/tuareg-mode-hs-start-regexp nil nil  cp/tuareg-mode-hs-forward-sexp-fun))
    :hook
    ((tuareg-mode . cp/enable-hideshow-and-hide-all)))

  (setq cp/tuareg-mode-hs-start-regexp
        (rx (or
             (: bow "module" eow
                (1+ whitespace)
                (or
                 (: (1+ (not whitespace))
                    (1+ whitespace)
                    (or
                     (: "=" (1+ whitespace) bow "struct" eow)
                     (: ":" (1+ whitespace) bow "sig" eow)))
                 (: bow "type" eow
                    (1+ whitespace)
                    (1+ (not whitespace))
                    (1+ whitespace)
                    "="
                    (1+ whitespace)
                    bow "sig" eow)))
             (: bow "end" eow
                (1+ whitespace)
                "="
                (1+ whitespace)
                bow "struct" eow)
             (: bow "let" eow
                (1+ whitespace))
             (: bow "and" eow
                (1+ whitespace))
             (: bow "let%" (1+ (not whitespace)) eow
                (1+ whitespace))
             (: bow "type" eow
                (+? (1+ whitespace) (1+ (not whitespace)))
                (1+ whitespace)
                "="))))

  (defun cp/tuareg-mode-hs-forward-sexp-fun (arg)
    (forward-line 1)
    (re-search-forward
     (rx-to-string
      `(or (: bol (** 0 ,(current-column) whitespace) (not whitespace))
           (: eos))
      t))
    (beginning-of-line)
    (back-to-indentation)
    (if (not
         (or
          (looking-at "in")
          (looking-at "end")
          (looking-at ";;")
          (looking-at "with")
          (eq (point) (buffer-size))))
        (progn
          (re-search-backward (rx bol (0+ whitespace) (not whitespace) any))
          (move-end-of-line nil))))
#+end_src

