emacs/.emacs.d/config.org
** Local overrides
Local overrides that I might want to vary from machine to machine. We're using ~condition-case~ here to ignore the file being potentially missing, but still throw errors if the file exists but there are errors processing the elisp within.

#+begin_src emacs-lisp :tangle init.el :padline no
  (load "init-local-overrides")
#+end_src

#+begin_src emacs-lisp :tangle init-lisp/init-local-overrides.el
  (condition-case nil
      (load-file (expand-file-name "~/.emacs.local"))
    (file-error nil))
#+end_src
